/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print_banner.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kebris-c <kebris-c@student.42madrid.com    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/10/30 12:35:54 by kebris-c          #+#    #+#             */
/*   Updated: 2025/10/31 18:03:56 by kebris-c         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "banner.h"
/* ex:
	██████╗ ██╗   ██╗███████╗██╗  ██╗       ███████╗██╗    ██╗ █████╗ ██████╗
	██╔══██╗██║   ██║██╔════╝██║  ██║       ██╔════╝██║    ██║██╔══██╗██╔══██╗
	██████╔╝██║   ██║███████╗███████║       ███████╗██║ █╗ ██║███████║██████╔╝
	██╔═══╝ ██║   ██║╚════██║██╔══██║       ╚════██║██║███╗██║██╔══██║██╔═══╝
	██║     ╚██████╔╝███████║██║  ██║██████╗███████║╚███╔███╔╝██║  ██║██║
	╚═╝      ╚═════╝ ╚══════╝╚═╝  ╚═╝╚═════╝╚══════╝ ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝
*/

static t_font_dict *find_ch(t_font_dict *dict, char c)
{
	if (c >= 'a' && c <= 'z')
		c -= 32;
    while (dict)
    {
        if (dict->ch == c)
            return (dict);
        dict = dict->next;
    }
    return (NULL);
}

static void	print_font(const char *text)
{
	t_font_dict	*dict;
	t_font_dict	*node;
	int			i;
	int			line;

	dict = create_font_dict();
	line = 0;
	while (line < 6)
	{
		i = 0;
		while (text[i])
		{
			node = find_ch(dict, text[i]);
			if (node)
				ft_printf(CYAN "%s " RESET, node->lines[line]);
			else
				ft_printf("      ");
			i++;
		}
		ft_printf("\n");
		line++;
	}
	free_font_dict(dict);
}

void	print_banner(const char *text)
{
	print_font(text);
	ft_printf(GREEN "                       ,_,\n");
	ft_printf("                      (O,O)\n");
	ft_printf("                      (   )\n");
	ft_printf("                      -\"-\"-\n");
	ft_printf(CYAN "-------------------------------------------------\n");
	ft_printf("------------------" YELLOW " by kebris-c " CYAN "------------------\n");
	ft_printf("----------------------- 🦉 ----------------------\n" RESET);
}